OE625b/gsoapClient/SENT.log

POST /calcservice HTTP/1.1
Host: 192.168.1.104:15618
User-Agent: gSOAP/2.8
Content-Type: application/soap+xml; charset=utf-8; action="http://o2.jrrpc.com/ICalc/Add"
Content-Length: 1061
Connection: close
SOAPAction: "http://o2.jrrpc.com/ICalc/Add"

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:JR4="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:JR1="http://tempuri.org/" xmlns:JR3="http://o2.jrrpc.com/" xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:wsc="http://schemas.xmlsoap.org/ws/2005/02/sc" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex" xmlns:wsa5="http://www.w3.org/2005/08/addressing" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wst="http://schemas.xmlsoap.org/ws/2005/02/trust"><SOAP-ENV:Body><JR3:Add><JR3:x>11</JR3:x><JR3:y>22</JR3:y></JR3:Add></SOAP-ENV:Body></SOAP-ENV:Envelope>
